In [1]:
! pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\envs\myenv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (2.0.12)
Requirement already satisfied: ipython-genutils in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (8.13.2)
Requirement already satisfied: six in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: backcall in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: decorator in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: stack-data in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: colorama in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments>=2.4.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)

In [3]:
%load_ext sql
%sql sqlite:///factbook.db

### SQL JOINS
##### SQL Join statement is used to combine data from two or more tables based on a common field between them.

### Types of joins:
###### INNER JOINS
###### LEFT JOINS
###### FULL OUTER JOINS
###### RIGHT JOINS

## Structure of a JOIN statement

    SELECT Column_list
    FROM TABLE1
    [JOIN TYPE] TABLE2
    ON Table1.ColName = Table2.ColName

##### TABLE1 - First table to be joined
##### [JOIN TYPE] TABLE2 - The type of join you are using e.g LEFT JOIN / INNER JOIN
##### ON - Tells which columns to use to join the tables.

##### Displaying the tables in the database

In [4]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///factbook.db
Done.

[('sqlite_sequence', 'table'), ('facts', 'table'), ('cities', 'table')]

In [5]:
%%sql
SELECT *
FROM cities
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'Oranjestad', 37000, 1, '216'),
 (2, "Saint John'S", 27000, 1, '6'),
 (3, 'Abu Dhabi', 942000, 1, '184'),
 (4, 'Dubai', 1978000, 0, '184'),
 (5, 'Sharjah', 983000, 0, '184')]

In [6]:
%%sql
SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### INNER JOIN

###### > The inner join compares rows in Table1 with Table2 to check if anything matches based on the condition in the ON clause.
###### > When the join condition is met, SQL returns matched rows in both tables with the selected columns in the SELECT clause.

##### Getting cities from cities table for each country in facts table

In [7]:
%%sql
SELECT 
    facts.name AS Country,
    cities.name AS City
FROM facts
INNER JOIN cities ON cities.facts_id = facts.id
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Aruba', 'Oranjestad'),
 ('Antigua and Barbuda', "Saint John'S"),
 ('United Arab Emirates', 'Abu Dhabi'),
 ('United Arab Emirates', 'Dubai'),
 ('United Arab Emirates', 'Sharjah'),
 ('Afghanistan', 'Kabul'),
 ('Algeria', 'Algiers'),
 ('Algeria', 'Oran'),
 ('Azerbaijan', 'Baku'),
 ('Albania', 'Tirana')]

### Exercise
###### Use INNER JOIN to get only the Capital cities for each country.

In [8]:
%%sql
SELECT
    facts.name AS Country,
    cities.name AS City
FROM facts
INNER JOIN cities ON cities.facts_id = facts.id
WHERE cities.capital = 1
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Aruba', 'Oranjestad'),
 ('Antigua and Barbuda', "Saint John'S"),
 ('United Arab Emirates', 'Abu Dhabi'),
 ('Afghanistan', 'Kabul'),
 ('Algeria', 'Algiers'),
 ('Azerbaijan', 'Baku'),
 ('Albania', 'Tirana'),
 ('Armenia', 'Yerevan'),
 ('Andorra', 'Andorra La Vella'),
 ('Angola', 'Luanda')]

#### LEFT JOIN

###### > A LEFT JOIN will include all rows an inner join would select, plus any rows from the first (left) table that don't have a match in the second table.
###### > We could say that the LEFT JOIN return all rows in the left table and only rows in the right table that meet the condition in the ON clause.
###### > The result is NULL in the right table if there is no match for in the ON clause condition.
###### > When using INNER JOINS, you should always be thoughtful of the data you might be dropping in the process.

In [9]:
%%sql
SELECT
    f.name AS Country,
    c.name AS City
FROM facts f
LEFT JOIN cities c ON c.facts_id = f.id
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Afghanistan', 'Kabul'),
 ('Albania', 'Tirana'),
 ('Algeria', 'Algiers'),
 ('Algeria', 'Oran'),
 ('Andorra', 'Andorra La Vella'),
 ('Angola', 'Luanda'),
 ('Angola', 'Huambo'),
 ('Antigua and Barbuda', "Saint John'S"),
 ('Argentina', 'Buenos Aires'),
 ('Argentina', 'Cordoba')]

### RIGHT JOIN

###### > A right join, as the name suggests, is exactly the opposite of a left join.
###### > While the left join includes all rows in the table before the JOIN clause, the right join includes all rows in the new table in the JOIN clause.
###### > The main reason a right join would be used is when you are joining more than two tables, otherwise RIGHT JOINS are rarely used.

### FULL OUTER JOIN

###### > A full outer join will include all rows from the tables on both sides of the join.
###### > FULL OUTER JOIN is not supported by SQLite

### Exercise

#### Question 1

Write a query that gathers data about the invoice with an invoice_id of 5. Include the following columns
The id of the track, track_id.
The name of the track, track_name.
The name of media type of the track, track_type.
The price that the customer paid for the track, unit_price.

In [10]:
%load_ext sql
%sql sqlite:///music.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%%sql
SELECT
    t.track_id AS track_id,
    t.name AS track_name,
    m.name AS track_type,
    il.unit_price AS unit_price
FROM invoice i
LEFT JOIN invoice_line il ON il.invoice_id = i.invoice_id
LEFT JOIN track t ON t.track_id = il.track_id
LEFT JOIN media_type m ON m.media_type_id = t.media_type_id
WHERE i.invoice_id = 5;

   sqlite:///factbook.db
 * sqlite:///music.db
Done.

[(1986, 'Intro', 'MPEG audio file', 0.99),
 (1987, 'School', 'MPEG audio file', 0.99),
 (1988, 'Drain You', 'MPEG audio file', 0.99),
 (1989, 'Aneurysm', 'MPEG audio file', 0.99),
 (1990, 'Smells Like Teen Spirit', 'MPEG audio file', 0.99),
 (1991, 'Been A Son', 'MPEG audio file', 0.99),
 (1992, 'Lithium', 'MPEG audio file', 0.99),
 (1993, 'Sliver', 'MPEG audio file', 0.99),
 (1994, 'Spank Thru', 'MPEG audio file', 0.99),
 (1995, 'Scentless Apprentice', 'MPEG audio file', 0.99),
 (1996, 'Heart-Shaped Box', 'MPEG audio file', 0.99),
 (1997, 'Milk It', 'MPEG audio file', 0.99),
 (1998, 'Negative Creep', 'MPEG audio file', 0.99),
 (1999, 'Polly', 'MPEG audio file', 0.99),
 (2000, 'Breed', 'MPEG audio file', 0.99),
 (2001, "Tourette's", 'MPEG audio file', 0.99),
 (2002, 'Blew', 'MPEG audio file', 0.99)]

#### Question 2

Add a column containing the artists name to the query from the previous question.The column should be called artist_name.The column should come last in the result table.

In [12]:
%%sql
SELECT
    t.track_id AS track_id,
    t.name AS track_name,
    m.name AS track_type,
    il.unit_price AS unit_price,
    a.name AS artist_name
FROM invoice i
LEFT JOIN invoice_line il ON il.invoice_id = i.invoice_id
LEFT JOIN track t ON t.track_id = il.track_id
LEFT JOIN media_type m ON m.media_type_id = t.media_type_id
LEFT JOIN album al ON al.album_id = t.album_id
LEFT JOIN artist a ON a.artist_id = al.artist_id
WHERE i.invoice_id = 5;

   sqlite:///factbook.db
 * sqlite:///music.db
Done.

[(1986, 'Intro', 'MPEG audio file', 0.99, 'Nirvana'),
 (1987, 'School', 'MPEG audio file', 0.99, 'Nirvana'),
 (1988, 'Drain You', 'MPEG audio file', 0.99, 'Nirvana'),
 (1989, 'Aneurysm', 'MPEG audio file', 0.99, 'Nirvana'),
 (1990, 'Smells Like Teen Spirit', 'MPEG audio file', 0.99, 'Nirvana'),
 (1991, 'Been A Son', 'MPEG audio file', 0.99, 'Nirvana'),
 (1992, 'Lithium', 'MPEG audio file', 0.99, 'Nirvana'),
 (1993, 'Sliver', 'MPEG audio file', 0.99, 'Nirvana'),
 (1994, 'Spank Thru', 'MPEG audio file', 0.99, 'Nirvana'),
 (1995, 'Scentless Apprentice', 'MPEG audio file', 0.99, 'Nirvana'),
 (1996, 'Heart-Shaped Box', 'MPEG audio file', 0.99, 'Nirvana'),
 (1997, 'Milk It', 'MPEG audio file', 0.99, 'Nirvana'),
 (1998, 'Negative Creep', 'MPEG audio file', 0.99, 'Nirvana'),
 (1999, 'Polly', 'MPEG audio file', 0.99, 'Nirvana'),
 (2000, 'Breed', 'MPEG audio file', 0.99, 'Nirvana'),
 (2001, "Tourette's", 'MPEG audio file', 0.99, 'Nirvana'),
 (2002, 'Blew', 'MPEG audio file', 0.99, 'Nirvana')]